# VisibleInViewFilter Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VisibleInViewFilter Constructor
VisibleInViewFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VisibleInViewFilter(Document, ElementId) | Constructs a new instance of a VisibleInViewFilter. |
| VisibleInViewFilter(Document, ElementId, Boolean) | Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements. |

# See Also
VisibleInViewFilter Class
VisibleInViewFilter Members
Autodesk.Revit.DB Namespace